Revit 2027 API
RebarConstrainedHandle.GetCustomHandleTag Method
 Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetCustomHandleTag()
Public Function GetCustomHandleTag As Integer
public:
int GetCustomHandleTag()
member GetCustomHandleTag : unit -> int
Return Value
Int32
 Returns the tag of custom handle.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle is not of RebarHandleType 'CustomHandle'.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace